
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/FarStep131/aws-ecs-terraform/actions/runs/3898416777)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-055727f5ccba597ad]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0428f7acba44b02de]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-031fbcc77366478e2]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01483500fb90326e5]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-06e3c9c3b88a8cbdb]
aws_security_group.alb: Refreshing state... [id=sg-008ad6434e1922eed]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-05cecac2f59b9a50a]
aws_security_group.ecs: Refreshing state... [id=sg-095739f8cbb16df5a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-048344991473e7d19]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-044bda4a5d3baa3bb]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08aa7f88453322b40]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0fce2ab3502f42164]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-05bcfdc9d71923d45]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1010692500]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0d7c082d750636ef1]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0647dbd04bd58e06d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c53033f3f0699fae]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d59c6f064d2dbf5b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-05bcfdc9d71923d451080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bfd7d30d17de4593]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-079a043aac6ef5f2e]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-044bda4a5d3baa3bb1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-06e3c9c3b88a8cbdb1080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0ecae8e109f9f1b83"
        id                   = "eipalloc-031fbcc77366478e2"
      + network_interface    = "eni-0f2df1799ec531ab2"
      + private_dns          = "ip-10-0-11-127.ap-northeast-1.compute.internal"
      + private_ip           = "10.0.11.127"
        tags                 = {
            "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-03a181c4210099170"
        id                   = "eipalloc-0428f7acba44b02de"
      + network_interface    = "eni-05fd8433b7bc09998"
      + private_dns          = "ip-10-0-12-42.ap-northeast-1.compute.internal"
      + private_ip           = "10.0.12.42"
        tags                 = {
            "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-044bda4a5d3baa3bb"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0647dbd04bd58e06d"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "aws-ecs-terraform-private-ap-northeast-1a"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-06e3c9c3b88a8cbdb"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0d7c082d750636ef1"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "aws-ecs-terraform-private-ap-northeast-1c"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-05bcfdc9d71923d45"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-05cecac2f59b9a50a"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "aws-ecs-terraform-public"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "go-simple-server-alb"
      + preserve_host_header       = false
      + security_groups            = [
          + "sg-008ad6434e1922eed",
        ]
      + subnets                    = [
          + "subnet-01483500fb90326e5",
          + "subnet-08aa7f88453322b40",
        ]
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-055727f5ccba597ad"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:targetgroup/go-simple-server-target-group/f86e0f04be1571a8]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Still creating... [2m30s elapsed]
aws_lb.alb: Still creating... [2m40s elapsed]
aws_lb.alb: Still creating... [2m50s elapsed]
aws_lb.alb: Still creating... [3m0s elapsed]
aws_lb.alb: Still creating... [3m10s elapsed]
aws_lb.alb: Creation complete after 3m16s [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:loadbalancer/app/go-simple-server-alb/d7e4de5af8f659a5]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener/app/go-simple-server-alb/d7e4de5af8f659a5/f0dc8980a8797b24]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:761817748648:listener-rule/app/go-simple-server-alb/d7e4de5af8f659a5/f0dc8980a8797b24/5e8e19685d01db8f]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"1102786afc3658b4dc41658601734591f032226d","Vars":{},"WorkflowName":"Terraform"} -->